app/Models/VilleModel.php

    public function getVille($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `ville`